# -*- coding: utf-8 -*-
# @Date：2025/5/26 14:16:49
# @Author：CJiaの用心
# @FileName：02-列表元素的添加.py
# @Editor：PyCharm2024
# @Remark：

""" 1. 不产生新的对象"""
# 1.1 append(元素) 在列表尾部添加新元素 -> 速度最快，推荐
a = [1, 2, 3]
print(a)  # [1, 2, 3]
a.append(4)
print(a)  # [1, 2, 3, 4]

# 1.2 extend() 将目标列表所有的元素添加到本列表尾部
c = [1, 2, 3]
print(c, id(c))  # [1, 2, 3] 1801679277248
c.extend([4, 5, 6])
print(c, id(c))  # [1, 2, 3, 4, 5, 6] 1801679277248

# 1.3 insert(索引, 元素) 插入元素 -> 影响处理速度
d = ["a", "b", "c", "d"]
print(d, id(d))  # ['a', 'b', 'c', 'd'] 2574268787008
d.insert(1, "e")
print(d, id(d))  # ['a', 'e', 'b', 'c', 'd'] 2574268787008

""" 2. 产生新的对象"""
# 2.1 + 运算符(不推荐)
b = ["a", "b", "c"]
print(b, id(b))  # ['a', 'b', 'c'] 1981031124160
b = b + ["d"]
print(b, id(b))  # ['a', 'b', 'c', 'd'] 1981031120960
